bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
/**
 * @file garuda_service.c
 *
 * @brief ESC state machine and ADC ISR.
 *
 * State machine (driven from ADC ISR at PWM rate):
 *   IDLE → ARMED (throttle=0 for 500ms) → ALIGN → OL_RAMP
 *   → (Phase 2: CLOSED_LOOP)
 *
 * Timer1 ISR: 100us tick for heartbeat, board service, and commutation timing.
 *
 * Component: GARUDA SERVICE
 */

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>

#include "garuda_service.h"
#include "garuda_types.h"
#include "garuda_config.h"
#include "garuda_calc_params.h"
#include "hal/hal_adc.h"
#include "hal/hal_pwm.h"
#include "hal/board_service.h"
#include "hal/port_config.h"
#include "motor/commutation.h"
#include "motor/startup.h"
#if FEATURE_BEMF_CLOSED_LOOP
#include "motor/bemf_zc.h"
#endif
#if FEATURE_ADC_CMP_ZC
#include "motor/hwzc.h"
#include "hal/hal_timer.h"
#endif

#if FEATURE_LEARN_MODULES
#include "learn/learn_service.h"
#endif

#if (FEATURE_RX_PWM || FEATURE_RX_DSHOT || FEATURE_RX_AUTO)
#include "input/rx_decode.h"
#endif

#include "x2cscope/diagnostics.h"

/* Global ESC runtime data — volatile: shared between ISRs and main loop */
volatile GARUDA_DATA_T garudaData;

/* Heartbeat LED counter */
static uint16_t heartbeatCounter = 0;
/* Sub-counter for 1ms system tick from 100us Timer1 */
static uint8_t msSubCounter = 0;

#if FEATURE_BEMF_CLOSED_LOOP
/* File-scope statics for ZC — only accessed from ADC ISR, NOT Timer1 ISR */
static uint16_t adcIsrTick = 0;
static ESC_STATE_T prevAdcState = ESC_IDLE;

#if FEATURE_SINE_STARTUP
/* Helper macro: write trap duties for active/float/low phases.
 * Uses virtual neutral (midpoint of active and low) for float phase. */
#define MORPH_WRITE_TRAP_DUTIES(step, activeDuty) do { \
    uint32_t _tf = ((activeDuty) + MIN_DUTY) / 2; \
    const COMMUTATION_STEP_T *_s = &commutationTable[(step)]; \
    uint32_t _dA = (_s->phaseA == PHASE_PWM_ACTIVE) ? (activeDuty) : \
                   (_s->phaseA == PHASE_FLOAT) ? _tf : MIN_DUTY; \
    uint32_t _dB = (_s->phaseB == PHASE_PWM_ACTIVE) ? (activeDuty) : \
                   (_s->phaseB == PHASE_FLOAT) ? _tf : MIN_DUTY; \
    uint32_t _dC = (_s->phaseC == PHASE_PWM_ACTIVE) ? (activeDuty) : \
                   (_s->phaseC == PHASE_FLOAT) ? _tf : MIN_DUTY; \
    HAL_PWM_SetDutyCycle3Phase(_dA, _dB, _dC); \
} while(0)
#endif
#endif

/**
 * @brief Initialize ESC service data to safe defaults.
 */
void GARUDA_ServiceInit(void)
{
    garudaData.state = ESC_IDLE;
    garudaData.throttle = 0;
    garudaData.currentStep = 0;
    garudaData.direction = DIRECTION_DEFAULT;
    garudaData.duty = 0;
    garudaData.vbusRaw = 0;
    garudaData.potRaw = 0;
    garudaData.faultCode = FAULT_NONE;
    garudaData.alignCounter = 0;
    garudaData.rampStepPeriod = RT_INITIAL_STEP_PERIOD;
    garudaData.rampCounter = 0;
    garudaData.systemTick = 0;
    garudaData.armCounter = 0;
    garudaData.runCommandActive = false;
    garudaData.desyncRestartAttempts = 0;
    garudaData.recoveryCounter = 0;

    /* Throttle source init — unconditional (Finding 42/54).
     * Priority: ADC_POT > RX_AUTO > RX_PWM > RX_DSHOT > GSP */
#if FEATURE_ADC_POT
    garudaData.throttleSource = THROTTLE_SRC_ADC;
#elif FEATURE_RX_AUTO
    garudaData.throttleSource = THROTTLE_SRC_AUTO;
#elif FEATURE_RX_PWM
    garudaData.throttleSource = THROTTLE_SRC_PWM;
#elif FEATURE_RX_DSHOT
    garudaData.throttleSource = THROTTLE_SRC_DSHOT;
#elif FEATURE_GSP
    garudaData.throttleSource = THROTTLE_SRC_GSP;
#endif

#if FEATURE_HW_OVERCURRENT
    garudaData.ibusRaw = 0;
    garudaData.ibusMax = 0;
    garudaData.clpciTripCount = 0;
    garudaData.fpciTripCount = 0;
#endif

    garudaData.bemf.bemfRaw = 0;
    garudaData.bemf.zcThreshold = 0;
    garudaData.bemf.zeroCrossDetected = false;
    garudaData.bemf.cmpPrev = 0xFF;
    garudaData.bemf.cmpExpected = 0;
    garudaData.bemf.filterCount = 0;
    garudaData.bemf.ad2SettleCount = 0;
    garudaData.bemf.bemfSampleValid = true;

    garudaData.timing.stepPeriod = 0;
    garudaData.timing.lastCommTick = 0;
    garudaData.timing.lastZcTick = 0;
    garudaData.timing.prevZcTick = 0;
    garudaData.timing.zcInterval = 0;
    garudaData.timing.commDeadline = 0;
    garudaData.timing.forcedCountdown = 0;
    garudaData.timing.goodZcCount = 0;
    garudaData.timing.consecutiveMissedSteps = 0;
    garudaData.timing.stepsSinceLastZc = 0;
    for (uint8_t i = 0; i < 6; i++)
        garudaData.timing.stepMissCount[i] = 0;
    garudaData.timing.risingZcWorks = false;
    garudaData.timing.fallingZcWorks = false;
    garudaData.timing.zcSynced = false;
    garudaData.timing.deadlineActive = false;
    garudaData.timing.hasPrevZc = false;
#if FEATURE_BEMF_INTEGRATION || FEATURE_ADC_CMP_ZC
    garudaData.timing.deadlineIsZc = false;
#endif

    /* ISR priority setup */
#if FEATURE_ADC_CMP_ZC
    _AD1CH0IP = 6;      /* ADC ISR lowered from 7 to 6 when HW ZC available */
    _AD1CMP5IP = 7;     /* AD1 comparator CH5: highest priority */
    _AD2CMP1IP = 7;     /* AD2 comparator CH1: highest priority */
    _CCT1IP = 7;        /* SCCP1 timer: highest priority */
#endif

    /* Enable ADC interrupt to start the control loop */
    GARUDA_ClearADCIF();
    GARUDA_EnableADCInterrupt();

#if FEATURE_ADC_CMP_ZC
    HWZC_Init(&garudaData);
    HAL_ADC_InitHighSpeedBEMF();
    HAL_SCCP1_Init();
    HAL_SCCP2_Init();
    HAL_SCCP3_InitPeriodic(HWZC_SCCP3_PERIOD);  /* Start high-speed ADC trigger */
#endif

#if FEATURE_LEARN_MODULES
    LEARN_ServiceInit(&garudaData);
#endif
}

/**
 * @brief ADC ISR — runs at PWM rate (24kHz).
 * Reads BEMF/Vbus, runs state machine, updates PWM.
 * Phase 2: sole commutation owner for CLOSED_LOOP state
 * (bypassed when DIAGNOSTIC_MANUAL_STEP=1).
 */
void __attribute__((__interrupt__, no_auto_psv)) GARUDA_ADC_INTERRUPT(void)
{
    /* Read all ADC buffers. MUST read AD1CH0DATA first — interrupt source.
     * AD1CH0 = Phase B voltage (RB8/AD1AN11, always sampled)
     * AD2CH0 = Phase A or C voltage (muxed per commutation step)
     * AD2CH0DATA is safe: same PWM trigger, same SAMC, ISR latency guarantees done. */
    uint16_t phaseB_val = ADCBUF_PHASE_B;
    uint16_t phaseAC_val = ADCBUF_PHASE_AC;
    garudaData.vbusRaw = ADCBUF_VBUS;
    garudaData.potRaw = ADCBUF_POT;

    /* Throttle source mux — unconditional switch (Finding 53/56) */
    switch (garudaData.throttleSource) {
#if FEATURE_GSP
        case THROTTLE_SRC_GSP:
            garudaData.throttle = (uint16_t)((uint32_t)garudaData.gspThrottle * 4095 / 2000);
            break;
#endif
#if (FEATURE_RX_PWM || FEATURE_RX_DSHOT || FEATURE_RX_AUTO)
        case THROTTLE_SRC_PWM:
        case THROTTLE_SRC_DSHOT:
        case THROTTLE_SRC_AUTO:
            garudaData.throttle = rxCachedLocked ? rxCachedThrottleAdc : 0;
            break;
#endif
#if FEATURE_ADC_POT
        case THROTTLE_SRC_ADC:
            garudaData.throttle = garudaData.potRaw;
            break;
#endif
        default:
            /* Safety fallback — zero throttle for corrupted enum or disabled source.
             * Never reads floating ADC. (Finding 56) */
            garudaData.throttle = 0;
            break;
    }

#if FEATURE_BEMF_CLOSED_LOOP
    /* Capture entry state for transition detection. Must be saved before
     * any state changes (morph→CL etc.) so the NEXT tick sees the transition. */
    ESC_STATE_T entryState = garudaData.state;

    /* Duty-proportional ZC threshold = virtual neutral point.
     * neutral = Vbus * duty / (2 * LOOPTIME_TCY)
     * Approximated as (vbusRaw * duty) >> 18 for 24kHz PWM.
     *
     * Asymmetric IIR smoothing prevents threshold-BEMF mismatch during
     * rapid duty transients.  Threshold tracks UP fast (motor accelerating,
     * BEMF rising) but DOWN slowly (motor coasting, BEMF stays high).
     * Rise: tau ~0.33ms (8 ticks).  Fall: tau ~10.7ms (256 ticks). */
    static uint16_t zcThreshSmooth = 0;
    {
        uint16_t rawThresh = (uint16_t)(
            ((uint32_t)garudaData.vbusRaw * garudaData.duty) >> ZC_DUTY_THRESHOLD_SHIFT);

        if (garudaData.state == ESC_CLOSED_LOOP
#if FEATURE_SINE_STARTUP
            || (garudaData.state == ESC_MORPH
                && (garudaData.morph.subPhase == MORPH_HIZ
                    || garudaData.morph.subPhase == MORPH_WINDOWED_HIZ))
#endif
           )
        {
            if (prevAdcState != ESC_CLOSED_LOOP
#if FEATURE_SINE_STARTUP
                && !(garudaData.state == ESC_MORPH
                     && (garudaData.morph.subPhase == MORPH_HIZ
                         || garudaData.morph.subPhase == MORPH_WINDOWED_HIZ)
                     && prevAdcState == ESC_MORPH)
#endif
               )
            {
                zcThreshSmooth = rawThresh;
            }
#if FEATURE_SINE_STARTUP
            /* Guardrail #7: only consume in windowed context — stale flag
             * from a prior run can't accidentally reseed during normal CL. */
            else if (garudaData.morph.forceThreshSeed
                     && garudaData.state == ESC_MORPH
                     && garudaData.morph.subPhase == MORPH_WINDOWED_HIZ)
            {
                zcThreshSmooth = rawThresh;
                garudaData.morph.forceThreshSeed = false;
            }
#endif
            else if (rawThresh >= zcThreshSmooth)
            {
                /* Rising — track fast (tau ~8 ticks = 0.33ms) */
                zcThreshSmooth += ((uint16_t)(rawThresh - zcThreshSmooth) + 4) >> 3;
            }
            else
            {
                /* Falling — track slow (tau ~256 ticks = 10.7ms) */
                uint16_t decay = ((uint16_t)(zcThreshSmooth - rawThresh) + 128) >> 8;
                if (decay == 0) decay = 1;  /* Guarantee convergence */
                zcThreshSmooth -= decay;
            }
            garudaData.bemf.zcThreshold = zcThreshSmooth;
        }
        else
        {
            zcThreshSmooth = rawThresh;  /* Non-CL: instant tracking */
            garudaData.bemf.zcThreshold = rawThresh;
        }
    }
#else
    garudaData.bemf.zcThreshold = garudaData.vbusRaw >> 1;
#endif

#if FEATURE_BEMF_CLOSED_LOOP
    /* Store floating phase ADC value in bemfRaw with validity tracking */
    {
        uint8_t fp = commutationTable[garudaData.currentStep].floatingPhase;
        if (fp == FLOATING_PHASE_B)
        {
            garudaData.bemf.bemfRaw = phaseB_val;
            garudaData.bemf.bemfSampleValid = true;
        }
        else if (garudaData.bemf.ad2SettleCount > 0)
        {
            garudaData.bemf.bemfRaw = phaseAC_val;
            garudaData.bemf.bemfSampleValid = false;
            garudaData.bemf.ad2SettleCount--;
        }
        else
        {
            garudaData.bemf.bemfRaw = phaseAC_val;
            garudaData.bemf.bemfSampleValid = true;
        }
    }
    adcIsrTick++;
#else
    garudaData.bemf.bemfRaw = phaseB_val;
    (void)phaseAC_val;  /* AD2CH0DATA must be read; suppress unused warning */
#endif

    /* Bus voltage fault enforcement (OV/UV) */
#if FEATURE_VBUS_FAULT
    {
        static uint8_t vbusOvCount = 0, vbusUvCount = 0;

        if (garudaData.state >= ESC_ALIGN && garudaData.state <= ESC_CLOSED_LOOP)
        {
            if (garudaData.vbusRaw > RT_VBUS_OVERVOLTAGE_ADC)
            {
                if (++vbusOvCount >= VBUS_FAULT_FILTER)
                {
#if FEATURE_ADC_CMP_ZC
                    if (garudaData.hwzc.enabled)
                        HWZC_Disable(&garudaData);
                    garudaData.hwzc.fallbackPending = false;
#endif
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                    HAL_MC1PWMDisableOutputs();
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_OVERVOLTAGE;
                    garudaData.runCommandActive = false;
                    LED2 = 0;
                }
            }
            else { vbusOvCount = 0; }

            {
                /* Determine UV threshold: relaxed during pre-sync startup to
                 * tolerate bus sag from CC-limited bench supply. Normal
                 * threshold resumes after ZC sync is achieved. */
                uint16_t uvThreshold = RT_VBUS_UNDERVOLTAGE_ADC;
#if FEATURE_PRESYNC_RAMP
                if (garudaData.state <= ESC_OL_RAMP
                    || (garudaData.state == ESC_CLOSED_LOOP
                        && !garudaData.timing.zcSynced))
                    uvThreshold = RT_VBUS_UV_STARTUP_ADC;
#endif

